
create_clock -period 20.000 -name CLK -waveform {0.000 10.000} [get_ports s00_axi_aclk]
set_input_delay -clock [get_clocks *] 2.000 [get_ports {rxdi s00_axi_araddr[0] s00_axi_araddr[1] s00_axi_araddr[2] s00_axi_araddr[3] s00_axi_araddr[4] s00_axi_araddr[5] s00_axi_aresetn s00_axi_arprot[0] s00_axi_arprot[1] s00_axi_arprot[2] s00_axi_arvalid s00_axi_awaddr[0] s00_axi_awaddr[1] s00_axi_awaddr[2] s00_axi_awaddr[3] s00_axi_awaddr[4] s00_axi_awaddr[5] s00_axi_awprot[0] s00_axi_awprot[1] s00_axi_awprot[2] s00_axi_awvalid s00_axi_bready s00_axi_rready s00_axi_wdata[0] s00_axi_wdata[10] s00_axi_wdata[11] s00_axi_wdata[12] s00_axi_wdata[13] s00_axi_wdata[14] s00_axi_wdata[15] s00_axi_wdata[16] s00_axi_wdata[17] s00_axi_wdata[18] s00_axi_wdata[19] s00_axi_wdata[1] s00_axi_wdata[20] s00_axi_wdata[21] s00_axi_wdata[22] s00_axi_wdata[23] s00_axi_wdata[24] s00_axi_wdata[25] s00_axi_wdata[26] s00_axi_wdata[27] s00_axi_wdata[28] s00_axi_wdata[29] s00_axi_wdata[2] s00_axi_wdata[30] s00_axi_wdata[31] s00_axi_wdata[3] s00_axi_wdata[4] s00_axi_wdata[5] s00_axi_wdata[6] s00_axi_wdata[7] s00_axi_wdata[8] s00_axi_wdata[9] s00_axi_wstrb[0] s00_axi_wstrb[1] s00_axi_wstrb[2] s00_axi_wstrb[3] s00_axi_wvalid}]
set_output_delay -clock CLK 2.000 [get_ports * -filter direction==out]